FSI/cylinderFlap_2D/OpenFOAM-FEniCS/Fluid/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: With OpenFOAM v1806 and OpenFOAM 6, the DyM solvers
// were marked deprecated and merged into their respective standard solvers.
application         pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
//application         pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             25;

deltaT              0.005;

writeControl        adjustableRunTime;

writeInterval       0.1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       12;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
