FSI/cylinderFlap_2D/OpenFOAM-FEniCS/Fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-10;
        relTol           1e-6;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-6;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    tolerance 1.0e-14;
    relTol 5e-3;
    pisoTol 1e-6;
    consistent  true;

    nOuterCorrectors 50;

    // OpenFOAM (.com), OpenFOAM 5 or older (.org)
    /*
    residualControl
    {
        U
        {
            tolerance 5e-5;
            relTol      0;
        }
        p
        {
            tolerance 5e-4;
            relTol      0;
        }
    }
    */

    // OpenFOAM 6 (.org) or newer
    /*
    residualControl
    {
        U 5e-5;
        p 5e-4;
    }
    */
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}


// ************************************************************************* //
